print('Здравствуйте я очень рад что ВЫ будет меня проверять, спасибо')
print('Я сделал файл запуска для вашего удобства')

#   Задание 1


#   Описание задания в терминале(Для удобства преподавателя)
print('')
print('Задача 1. Кубы чисел')
print('')
print('Что нужно сделать')
print('')
print('Напишите программу, которая возводит в третью степень каждое число ')
print('от 1 до N и выводит результат на экран.')
print('')
import task_1


#   Задание 2

#   Описание задания в терминале(Для удобства преподавателя)
print('')
print('Задача 2. Слишком большие числа')
print('')
print('Что нужно сделать:')
print('')
print('Напишите программу, которая считала бы, сколько цифр во вводимом числе. ')
print('Учтите, что программа должна получать только положительные числа ')
print('и что число 0 имеет одну цифру.')
print('')
print('')
import task_2


#   Задание 3

#   Описание задания в терминале(Для удобства преподавателя)
print('')
print('Задача 3. Обычный день на работе')
print('Что нужно сделать')
print('Напишите программу,')
print('в которой считается, сколько задач выполнил Максим за день (восемь часов). ')
print('Если он хотя бы раз взял трубку, то в конце дополнительно выводите сообщение')
print('Нужно зайти в магазин')
print('')
import task_3

#   Задание 4

#   Описание задания в терминале(Для удобства преподавателя)
print('')
print('Задача 4. Вклады')
print('Что нужно сделать')
print('Напишите программу,')
print('которая по данным числам X, Y, P определяет,сколько лет пройдёт')
print('Если он хотя бы раз взял трубку, то в конце дополнительно выводите сообщение')
print('Нужно зайти в магазин')
print('')
import task_4

#   Задание 5
print('')
print('Задача 5. Игра «Угадай число»')
print('Что нужно сделать')
print('Напишите программу-игру')
print('в которой один человек загадывает число от 1 до 10')
print('а другой пытается его угадать')
print('Программа должна запрашивать число у пользователя до тех пор')
print('пока тот не угадает загаданное')
print('После каждой попытки выводите подсказки')
print('больше или меньше загаданного введённое число')
print('Также после отгадки выводите количество попыток.')

import task_5


#   Прощание с преподавателем
print('Какую бы вы мне оценку поставили? ')
int(input(":-)   "))
print('Спасибо!')